cmsis-svd/cmsis-svd/data/Atmel/ATSAM4S2B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DACC</name>
      <version>6461K</version>
      <description>Digital-to-Analog Converter Controller</description>
      <prependToName>DACC_</prependToName>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DACC</name>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRGEN</name>
              <description>Trigger Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>External trigger mode disabled. DACC in free-running mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>External trigger mode enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRGSEL0</name>
                  <description>External trigger</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL1</name>
                  <description>TIO Output of the Timer Counter Channel 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL2</name>
                  <description>TIO Output of the Timer Counter Channel 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL3</name>
                  <description>TIO Output of the Timer Counter Channel 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL4</name>
                  <description>PWM Event Line 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL5</name>
                  <description>PWM Event Line 1</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WORD</name>
              <description>Word Transfer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALF</name>
                  <description>Half-word transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>Word transfer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONE</name>
              <description>Must Be Set to 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USER_SEL</name>
              <description>User Channel Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Tag Selection Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Tag selection mode disabled. Using USER_SEL to select the channel for the conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Tag selection mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXS</name>
              <description>Maximum Speed Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <description>Maximum speed mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Startup Time Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0 periods of peripheral clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 periods of peripheral clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 periods of peripheral clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>24 periods of peripheral clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 periods of peripheral clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80</name>
                  <description>80 periods of peripheral clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>96</name>
                  <description>96 periods of peripheral clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>112</name>
                  <description>112 periods of peripheral clock</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 periods of peripheral clock</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>576</name>
                  <description>576 periods of peripheral clock</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>640</name>
                  <description>640 periods of peripheral clock</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>704</name>
                  <description>704 periods of peripheral clock</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>768</name>
                  <description>768 periods of peripheral clock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>832</name>
                  <description>832 periods of peripheral clock</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>896</name>
                  <description>896 periods of peripheral clock</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>960</name>
                  <description>960 periods of peripheral clock</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 periods of peripheral clock</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1088</name>
                  <description>1088 periods of peripheral clock</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1152</name>
                  <description>1152 periods of peripheral clock</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1216</name>
                  <description>1216 periods of peripheral clock</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1280</name>
                  <description>1280 periods of peripheral clock</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1344</name>
                  <description>1344 periods of peripheral clock</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1408</name>
                  <description>1408 periods of peripheral clock</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1472</name>
                  <description>1472 periods of peripheral clock</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1536</name>
                  <description>1536 periods of peripheral clock</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1600</name>
                  <description>1600 periods of peripheral clock</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1664</name>
                  <description>1664 periods of peripheral clock</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1728</name>
                  <description>1728 periods of peripheral clock</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1792</name>
                  <description>1792 periods of peripheral clock</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1856</name>
                  <description>1856 periods of peripheral clock</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1920</name>
                  <description>1920 periods of peripheral clock</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1984</name>
                  <description>1984 periods of peripheral clock</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048</name>
                  <description>2048 periods of peripheral clock</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2112</name>
                  <description>2112 periods of peripheral clock</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2176</name>
                  <description>2176 periods of peripheral clock</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2240</name>
                  <description>2240 periods of peripheral clock</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2304</name>
                  <description>2304 periods of peripheral clock</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2368</name>
                  <description>2368 periods of peripheral clock</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2432</name>
                  <description>2432 periods of peripheral clock</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2496</name>
                  <description>2496 periods of peripheral clock</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2560</name>
                  <description>2560 periods of peripheral clock</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2624</name>
                  <description>2624 periods of peripheral clock</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2688</name>
                  <description>2688 periods of peripheral clock</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2752</name>
                  <description>2752 periods of peripheral clock</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2816</name>
                  <description>2816 periods of peripheral clock</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2880</name>
                  <description>2880 periods of peripheral clock</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2944</name>
                  <description>2944 periods of peripheral clock</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3008</name>
                  <description>3008 periods of peripheral clock</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3072</name>
                  <description>3072 periods of peripheral clock</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3136</name>
                  <description>3136 periods of peripheral clock</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3200</name>
                  <description>3200 periods of peripheral clock</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3264</name>
                  <description>3264 periods of peripheral clock</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3328</name>
                  <description>3328 periods of peripheral clock</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3392</name>
                  <description>3392 periods of peripheral clock</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3456</name>
                  <description>3456 periods of peripheral clock</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3520</name>
                  <description>3520 periods of peripheral clock</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3584</name>
                  <description>3584 periods of peripheral clock</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3648</name>
                  <description>3648 periods of peripheral clock</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3712</name>
                  <description>3712 periods of peripheral clock</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3776</name>
                  <description>3776 periods of peripheral clock</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3840</name>
                  <description>3840 periods of peripheral clock</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3904</name>
                  <description>3904 periods of peripheral clock</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3968</name>
                  <description>3968 periods of peripheral clock</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4032</name>
                  <description>4032 periods of peripheral clock</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHER</name>
          <description>Channel Enable Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1</name>
              <description>Channel 1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHDR</name>
          <description>Channel Disable Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1</name>
              <description>Channel 1 Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSR</name>
          <description>Channel Status Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1</name>
              <description>Channel 1 Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
